Autodesk.Revit.DB.TransactionGroup.GetName
Returns the transaction group's name. It could be an empty string.
Returns:
The transaction group's current name.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.SetName(System.String)
Sets the transaction group's name.
Remarks:
Transaction group only needs a name if it is going to be assimilated at the end.
name:
A name for the transaction group.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.TransactionGroup.HasEnded
Determines whether the transaction group has ended already.
Remarks:
A transaction is ended by completing either the Commit
or RollBack or Assimilate method.
Another way of testing whether a transaction group has ended is by testing
its current status returned from (see Autodesk.Revit.DB.TransactionGroup.GetStatus). It must be either
'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
Returns:
True if the transaction group has already been committed or rolled back, False otherwise.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.HasStarted
Determines whether the transaction has been started yet.
Remarks:
A transaction group is considered being started after the Start
method was called and until the transaction group is either completely committed
or rolled back. A transaction group can only be Started when HasStarted returns false.
Returns:
True if the transaction group has already started, False otherwise.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.GetStatus
Gets the current status of the transaction group.
Returns:
The current status of the transaction group.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.RollBack
Rolls back the transaction group, which effectively undoes all transactions committed inside the group.
Remarks:
Note that once a group is rolled back, the undone transactions cannot be redone.
RollBack can be called only when all inner transaction groups and transactions are finished,
i.e. after they were either committed or rolled back.
Returns:
If finished successfully, this method returns TransactionStatus.RolledBack.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Transaction group has not been started (its status is not 'Started')..
-or-
The transaction's document is currently in failure mode.
Transaction groups cannot be closed until failure handling is finished.
You may use a transaction finalizer to close a group after the failure handling ends.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.Assimilate
Assimilates all inner transactions by merging them into a single undo item.
Remarks:
After a successful assimilation the transaction group is committed.
All transactions committed inside this group will be merged into one
single transaction. The resulting undo item will bear this group's name.
Assimilate can be called only when all inner transaction groups and transactions
are finished, i.e. after they were either committed or rolled back.
Returns:
If finished successfully, this method returns TransactionStatus.Committed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Transaction group has not been started (its status is not 'Started')..
-or-
The transaction's document is currently in failure mode.
Transaction groups cannot be closed until failure handling is finished.
You may use a transaction finalizer to close a group after the failure handling ends.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.Commit
Commits the transaction group.
Remarks:
Committing a group does not change the model.
It only confirms the commitment of all inner groups and transactions.
Commit can be called only when all inner transaction groups and transactions are finished,
i.e. after they were either committed or rolled back. If there is still a transaction or an inner
transaction group open, an attempt to commit this outer group will cause an exception.
Returns:
If finished successfully, this method returns TransactionStatus.Committed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Transaction group has not been started (its status is not 'Started')..
-or-
The transaction's document is currently in failure mode.
Transaction groups cannot be closed until failure handling is finished.
You may use a transaction finalizer to close a group after the failure handling ends.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.Start(System.String)
Starts the transaction group with an assigned name.
Remarks:
A transaction group can be started only when there is no transaction started currently.
It can be started inside another transaction group though. With such group nesting
it is required that inner transaction groups are finished (i.e. rolled back, committed,
or assimilated) before outer groups are.
transGroupName:
Name of the group.
The name will be used only for a group that is assimilated at the end.
Returns:
If started successfully, this method returns TransactionStatus.Started.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled.
-or-
Transaction group cannot be started during an active transaction.
-or-
The Transaction group has already been started.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.Start
Starts the transaction group
Remarks:
A transaction group can be started only when there is no transaction started currently.
It can be started inside another transaction group. When groups are nested inside each other
it is required that inner transaction groups are finished (i.e. rolled back, committed,
or assimilated) before outer groups are.
Returns:
If started successfully, this method returns TransactionStatus.Started.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled.
-or-
Transaction group cannot be started during an active transaction.
-or-
The Transaction group has already been started.
Since:
2011

Autodesk.Revit.DB.TransactionGroup.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TransactionGroup.IsFailureHandlingForcedModal
Forces all transactions finished inside this group to use modal failure handling
regardless of what failure handling options are set for those transactions.
Remarks:
This property is ignored during events, when failure handling is always modal.
Since:
2013

Autodesk.Revit.DB.TransactionGroup.#ctor(Autodesk.Revit.DB.Document,System.String)
It constructs a transaction group object
Remarks:
The group does not start until its Start method is called.
document:
The document for which this transaction group is being used.
transGroupName:
Name of the group.
The name will be used only for a group that is assimilated at the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.TransactionGroup.#ctor(Autodesk.Revit.DB.Document)
Constructs a transaction group object.
Remarks:
The group does not start until its Start method is called.
document:
The document for which this transaction group is being used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.TransactionGroup
Transaction groups aggregate a number of transactions.
Remarks:
A transaction group controls whether transactions committed inside the group should
stay committed or should be all discarded. If the group is committed, all the transactions
remain committed, but if the transaction group is rolled back instead, all the inner,
already committed transactions will be undone (and removed).
There are two ways of committing a group - Commit and Assimilate. By committing,
all transactions committed inside a group stay as they are, while by assimilating,
all inner transactions will be merged into a single transaction.
A transaction group can only be started when no transaction is active,
and must be closed only after the last transaction started inside the group is finished,
i.e. after it was either committed or rolled back.
Transaction groups may be nested inside each other with the restriction
that every nested transaction group is entirely contained (opened and closed)
in the parent transaction group.
If a transaction group was started and not finished yet by the time the TransactionGroup object
is about to be, the default destructor will roll it back automatically, thus all
changes made to the document while this transaction group was open will be discarded.
It is not recommended to rely on this default behavior though. Instead, it is advised
to always call either Autodesk.Revit.DB.TransactionGroup.Commit, Autodesk.Revit.DB.TransactionGroup.RollBack,
or Autodesk.Revit.DB.TransactionGroup.Assimilate explicitly before the group object gets destroyed.
Please note that unless invoked explicitly the actual destruction of an object
in managed code might not happen until the object is collected by the garbage collector.
Since:
2011